console.log('number' + 3 + 3);
//Відбувається конкатенація, до рядка "number" ми дописуємо справа спочатку 3, потім ще раз 3
//Результат: number33 

console.log (null + 3);
//null приводиться до нуля, далі ми ми виконуємо операцію додавання.  
//Результат: 3

console.log(5 && "qwerty");
// і 5, і "qwerty" приводяться до true. Ми виконуємо && і так як обидва значення true, то воно видає останнє значення.
//Результат: qwerty

console.log(+'40' + +'2' + "hillel");
//строки 40 і 2 приводяться до числа, виконується додавання, і ми отримуємо 42, після чого відбувається конкатенація (оскільки 'hillel'  це строка) і ми дописуємо справа 'hillel'
//результат: 42hillel

console.log('10' - 5 === 6);
//10 приводиться до числа. 10-5 дорівнює 5. 5 не дорівнює 6
//Результат: false

console.log(true + false);
// true приводиться до 1, false до 0, 1+0 дорівнює 1
//Результат: 1

console.log('4px' - 3);
// від рядка '4px' ми намагаємось відняти 3.  '4px' не приводиться до числа і в результаті математичноъ операції ми отримуємо not a number
//Результат: NaN

console.log('4' - 3);
//рядок 4 приводиться до числа і ми виконуємо просту операцію віднімання
//Результат: 1

console.log('6' + 3 ** 0);
//Спочатку виконуємо піднесення в ступінь 3 ** 0 (що дорівнює 1)
//Потім до рядка "6" ми дописуємо справа результат попередньої операції (тому що конкатенація)

console.log(12 / '6');
//Рядок "6" приводиться до числа, а далі ми виконуємо ділення 12 на 6
//Результат: 2

console.log('10' + (5 === 6));
//Спочатку виконуємо 5 === 6. % не дорівнює 6, тому результат false
//Потім до строки 10 дописуємо справа false (тому що конкатенація)
//Результат: 10false

console.log(null == '');
//null не дорівнює нічому (окрім undefined) тому при спробі його порівняти буде false
//Результат: false

console.log(3 ** (9 / 3));
// спочатку виконується ділення 9/3 що дорівнює 3, потім 3 підноситься в ступінь 3, що дорівнює 27
//Результат: 27

console.log(!!'false' == !!'true');
//І строка 'false' і строка 'true' дорівнюють true, бо це строки а не boolean
//За допомогою подвійного not (!!) перетворюємо їх на boolean.
//Потім порівнюємо true і true
//Результат: true

console.log(0 || '0' && 1);
//Спочатку виконуємо ||. Воно видасть нам '0', бо 0 це false, а '0' це true, і воно видає перше знайдене значення яке буде true
//Потім виконуємо && і так як обидва значення ('0' та 1) будуть true, то воно видає останнє обчислене значення.
//Результат: 1

console.log((+null == false) < 1);
//+null дорівнює 0, і false теж тому результатом +null == false буде true
//Потім порівнюємо true < 1. True не менше 1 (воно дорівнює 1)
//Результат: false

console.log(false && true || true);
//Спочатку виконуємо &&. Воно видасть нам false оскільки не обидва значення є true. 
//Потім виконуємо ||. Воно видасть нам true, бо серед двох значень false і true є хоча б одне true.
//Результат: true

console.log(false && (false || true));
//Спочатку виконуємо ||. Воно видасть нам true, бо серед двох значень false і true є хоча б одне true. 
//Потім виконуємо && Воно видасть нам false оскільки не обидва значення є true. 
//Результат: false

console.log((+null == false) < 1 ** 5);
//Спочатку виконуємо +null == false. +null дорівнює 0, і дорівнює false оскільки false теж дорівнює 0.
//Результатом буде true.
//Потім виконуємо піднесення до степені 1 ** 5 що дорівнюватиме 1 
//Далі виконуємо порівняння true<1. True не менше 1 (воно дорівнює 1)
//Результат: false